Repository: oussamamth1/quiz
Catalog: lib/src/l10n/app_*.arb
Languages: vi

# app_introduce
source: Test your skills with Quizwhizz
vi: Thử tài cùng Quizwhizz

# app_auth_action
source: Sign in / Register now
vi: Đăng nhập / Đăng ký tài khoản ngay bây giờ

# user_phone_number
source: Your phone number
vi: Số điện thoại của bạn

# user_display_name
source: Display Name
vi: Tên hiển thị

# user_accept_terms_1
source: I accept
vi: Tôi đồng ý với

# user_accept_terms_2
source: the Terms and Conditions
vi: Điều kiện và Điều khoản

# user_accept_terms_3
source: of
vi: liên quan đến việc sử dụng dịch vụ của

# authenticating
source: Please hold on
vi: Đang xác thực

# continue_text
source: Continue
vi: Tiếp tục

# other_login_method
source: Or continue with
vi: Hoặc đăng nhập bằng

# unknown_error
source: Unknown error! Please try again!
vi: Không xác định được lỗi! Vui lòng thử lại!

# user_enter_otp
source: Enter your OTP
vi: Nhập mã PIN

# otp_hint_text
source: Please enter the 6-digit code that was sent to your phone
vi: Vui lòng nhập mã số gồm 6 chữ số được gửi tới số điện thoại

# otp_expired
source: The code will expire in
vi: Mã sẽ hết hiệu lực trong

# banner_friend_join
source: Play quiz together with your friend now!
vi: Đến giờ chơi quiz cùng với bạn bè rồi!

# let_us_start
source: Let's start!
vi: Gét gô!

source: Show all
vi: Hiện tất cả

# question
source: questions
vi: câu hỏi

source: Home
vi: Trang chủ

source: Discovery
vi: Khám phá

source: Play
vi: Tham gia

source: Create
vi: Tạo mới

# settings
source: Setting
vi: Cài đặt

# setting_about
source: About
vi: Về chúng tôi

# setting_help
source: Help
vi: Trợ giúp

# setting_info
source: Personal Information
vi: Thông tin cá nhân

# setting_language
source: Language
vi: Ngôn ngữ

# setting_logout
source: Logout
vi: Đăng xuất

# setting_mode
source: Dark Mode
vi: Chế độ tối

# setting_notification
source: Notification
vi: Thông báo

# top_quiz
source: Top Quizz
vi: Quizz nổi bật

source: Top Collection
vi: Bộ sưu tập nổi bật

# quiz_played
source: Played
vi: Lượt chơi

# quiz_rating
source: Rating
vi: Đánh giá

# quiz_question_count
source: Question
vi: Số câu hỏi

# quiz_description
source: Description
vi: Mô tả câu hỏi

# quiz_description_empty
source: Empty
vi: Không có mô tả

# quiz_name
source: Title
vi: Tiêu đề

# quiz_play_friend
source: Play with Friend
vi: Chiến đấu

# quiz_play_solo
source: Play solo
vi: Tập luyện

# quiz_visibility
source: Visibility
vi: Hiển thị

# quiz_public
source: Public
vi: Công khai

# quiz_private
source: Private
vi: Riêng tư

# quiz_create
source: Create Quiz
vi: Tạo mới bộ đề

# question_create
source: Create Question
vi: Thêm mới câu hỏi

# quiz_add_question
source: Add Question
vi: Thêm câu hỏi

# question_add_title
source: Add title
vi: Thêm tiêu đề cho câu hỏi

# question_add_answer
source: Add answer
vi: Thêm câu trả lời

# question_enter_title
source: Enter title
vi: Nhập tiêu đề

# question_enter_answer
source: Enter answer
vi: Nhập câu trả lời

# question_correct_answer
source: Correct answer
vi: Câu trả lời đúng

# question_set_duration
source: Set duration
vi: Thời gian câu hỏi

# image_cover
source: Tap to add cover image!
vi: Hãy chạm vào đây để thêm ảnh bìa

source: Collection
vi: Bộ sưu tập

source: Save
vi: Lưu

source: Loading
vi: Đang xử lý

source: Edit Information
vi: Chỉnh sửa thông tin

# choose_image
source: Choose an image
vi: Chọn ảnh

source: Solo Mode
vi: Tập luyện

source: PvP Mode
vi: Chiến đấu

# participant
source: participants
vi: thí sinh

# lobby_start
source: Game starts in
vi: Trận đấu sẽ bắt đầu trong

# lobby_start_button
source: Start now
vi: Chiến nào

source: Leaderboard
vi: Bảng xếp hạng

# user_got_rank
source: You got rank {rank}
vi: Bạn xếp hạng {rank}

# quiz_satisfied
source: Are you satisfied with this test?
vi: Bạn có hài lòng với kết quả bài kiểm tra không?

source: Go Back
vi: Quay lại

# user_got_point
source: You got {point} points
vi: Bạn đạt được {point} điểm

# leaderboard_wait
source: Waiting to get leaderboard!
vi: Chờ đợi để lấy bảng xếp hạng!

source: Show Score
vi: Bảng điểm

source: Join Quiz
vi: Tham gia thi đấu

# join_button
source: Join
vi: Tham gia

# qr_code_title
source: Place the QR code in the area
vi: Đặt mã QR tại vị trí này

# qr_code_subtitle
source: Scanner will be started automatically!
vi: Máy quét sẽ tự động khởi động!

# quiz_edit
source: Edit Quiz
vi: Chỉnh sửa bộ đề

# discard_change_title
source: Discard changes?
vi: Bỏ qua các thay đổi?

# discard_change_subtitle
source: Changes you made won't be saved!
vi: Các thay đổi của bạn sẽ không được lưu lại!

# delete_title
source: Are you sure?
vi: Xác nhận?

# delete_subtitle
source: Do you want to delete this? This process cannot be undone.
vi: Bạn có chắc chắn muốn xóa? Tác vụ này không thể hoàn lại!

# profile_quiz
source: My Quiz
vi: Quizz

# profile_collecttion
source: My Collection
vi: Lưu trữ

# profile_save
source: Save
vi: Đánh dấu

# share_social_media
source: Share to Social Media
vi: Chia sẻ qua Mạng xã hội

source: Copy Quiz Link
vi: Sao chép liên kết

# bookmark_save_quiz
source: Save Quiz
vi: Đánh dấu bộ đề

# bookmark_save_quiz_successfully
source: Save quiz succesfully
vi: Lưu thành công

# quiz_save_action
source: Successfully!
vi: Thao tác thành công!

# lobby_cancel_title_host
source: Are you want to close?
vi: Bạn có muốn đóng phòng chờ không?

# lobby_cancel_description_host
source: The lobby will no longer exist and all players will be kicked out.
vi: Phòng chờ sẽ không còn tồn tại và tất cả người chơi sẽ bị đẩy ra ngoài.

# lobby_cancel_title_user
source: Do you want to leave the lobby?
vi: Bạn muốn thoát khỏi phòng chờ?

# lobby_cancel_description_user
source: ou will no longer be in this lobby!
vi: Bạn sẽ không còn trong phòng chờ này nữa!

# lobby_quit_title
source: Leave Room!
vi: Rời phòng!

# lobby_quit_description
source: The room owner has closed this lobby! Click to confirm to return to Home!
vi: Chủ phòng đã đóng phòng chờ này! Xác nhận để trở lại trang chính!

# collection_create_heading
source: Create Collection
vi: Thêm bộ sưu tập

# discovery_empty
source: Oops! There's nothong here! Create a new one!
vi: Đáng tiếc! Không có quiz nào ở đây cả! Tạo mới nào!

# search_quiz_not_found
source: No results found!
vi: Không tìm thấy kết quả!

# save_quiz_collection_title
source: Save quiz as...
vi: Lưu quiz vào...

# save_quiz_collection_positive
source: Save
vi: Lưu

# save_quiz_collection_negative
source: Create new!
vi: Tạo mới
